<!DOCTYPE html>
<html>
<body>
<div align="center">
<h1>Road to AI Session 2</h1>
    
<h3>Database,Graphs & Maths</h3>
<h4>PANDAS</h4>
</div>
</body>
</html>

## Importing the library

In [4]:
import numpy as np
import pandas as pd
print(pd.__version__)

1.1.3

## Reading the file

In [5]:
df = pd.read_csv('apy.csv')

## The Basics

In [6]:
df.head()

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0
3,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Banana,176.0,641.0
4,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Cashewnut,720.0,165.0

In [7]:
df.tail()

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
246086,West Bengal,PURULIA,2014,Summer,Rice,306.0,801.0
246087,West Bengal,PURULIA,2014,Summer,Sesamum,627.0,463.0
246088,West Bengal,PURULIA,2014,Whole Year,Sugarcane,324.0,16250.0
246089,West Bengal,PURULIA,2014,Winter,Rice,279151.0,597899.0
246090,West Bengal,PURULIA,2014,Winter,Sesamum,175.0,88.0

In [8]:
#We can see the dimensions of the dataframe using the the shape attribute
df.shape

(246091, 7)

In [9]:
#We can also extract all the column names as a list
df.columns.tolist()

['State_Name',
 'District_Name',
 'Crop_Year',
 'Season',
 'Crop',
 'Area',
 'Production']

In [10]:
#function to see statistics like mean, min, etc about each column of the dataset
df.describe()

           Crop_Year          Area    Production
count  246091.000000  2.460910e+05  2.423610e+05
mean     2005.643018  1.200282e+04  5.825034e+05
std         4.952164  5.052340e+04  1.706581e+07
min      1997.000000  4.000000e-02  0.000000e+00
25%      2002.000000  8.000000e+01  8.800000e+01
50%      2006.000000  5.820000e+02  7.290000e+02
75%      2010.000000  4.392000e+03  7.023000e+03
max      2015.000000  8.580100e+06  1.250800e+09

In [11]:
## max() will show you the maximum values of all columns
df.max()

State_Name          West Bengal
District_Name         ZUNHEBOTO
Crop_Year                  2015
Season              Winter
Crop             other oilseeds
Area                 8.5801e+06
Production           1.2508e+09
dtype: object

In [17]:
#get the max value for a particular column
df['Area'].max()

8580100.0

In [19]:
## find the mean of the Production score. 
df['Production'].mean()

582503.4422509839

In [20]:
## function to identify the row index
df['Production'].argmax()

178273

**value_counts()** shows how many times each item appears in the column. This particular command shows the number of games in each season

In [12]:
df['Area'].value_counts()

1.0        4553
2.0        3453
100.0      2824
3.0        2636
4.0        2273
           ...
82749.0       1
41375.0       1
32213.0       1
50170.0       1
15374.0       1
Name: Area, Length: 38442, dtype: int64

## Acessing Values

In [15]:
## get attributes
df.iloc[[df['Production'].argmax()]]

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
178273,Tamil Nadu,COIMBATORE,2011,Whole Year,Coconut,82704.0,1.250800e+09

In [23]:
df.iloc[[df['Production'].argmax()]]['Area']

178273    82704.0
Name: Area, dtype: float64

When you see data displayed in the above format, you're dealing with a Pandas **Series** object, not a dataframe object.

In [17]:
type(df.iloc[[df['Production'].argmax()]]['Area'])

pandas.core.series.Series

In [18]:
type(df.iloc[[df['Production'].argmax()]])

pandas.core.frame.DataFrame

The other really important function in Pandas is the **loc** function. Contrary to iloc, which is an integer based indexing, loc is a "Purely label-location based indexer for selection by label". Since the table are ordered from 0 to 145288, iloc and loc are going to be pretty interchangable in this type of dataset

In [21]:
df.iloc[:3]

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0

In [22]:
## loc is a "Purely label-location based indexer for selection by label"
df.loc[:3]

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0
3,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Banana,176.0,641.0

Notice the slight difference in that iloc is exclusive of the second number, while loc is inclusive.

Below is an example of how you can use loc to acheive the same task as we did previously with iloc

In [24]:
df.loc[df['Production'].argmax(), 'Area']

82704.0

A faster version uses the **at()** function. At() is really useful wheneever you know the row label and the column label of the particular value that you want to get.

In [27]:
df.at[df['Production'].argmax(),  'Area']

82704.0

# Sorting

In [29]:
## sort the dataframe in increasing order
df.sort_values('Area').head()

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
100325,Kerala,KOZHIKODE,2010,Whole Year,Sugarcane,0.04,NaN
100627,Kerala,MALAPPURAM,2010,Whole Year,Sugarcane,0.05,NaN
100339,Kerala,KOZHIKODE,2011,Whole Year,Sugarcane,0.05,NaN
101658,Kerala,THIRUVANANTHAPURAM,2014,Whole Year,Sugarcane,0.07,NaN
100642,Kerala,MALAPPURAM,2011,Whole Year,Sugarcane,0.09,NaN

In [25]:
df.groupby('Area')

# Filtering Rows Conditionally

In [27]:
df[df['Area'] > 500000]

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
208,Andhra Pradesh,ANANTAPUR,1997,Kharif,Groundnut,650800.0,228400.0
236,Andhra Pradesh,ANANTAPUR,1998,Kharif,Groundnut,755200.0,867800.0
261,Andhra Pradesh,ANANTAPUR,1999,Kharif,Groundnut,694865.0,249457.0
294,Andhra Pradesh,ANANTAPUR,2000,Kharif,Groundnut,791559.0,884963.0
342,Andhra Pradesh,ANANTAPUR,2001,Kharif,Groundnut,758700.0,333828.0
...,...,...,...,...,...,...,...
244290,West Bengal,MURSHIDABAD,1997,Rabi,Oilseeds total,5544000.0,4485800.0
244305,West Bengal,MURSHIDABAD,1997,Whole Year,Pulses total,4307200.0,3632200.0
244878,West Bengal,NADIA,1997,Rabi,Oilseeds total,8580100.0,7556300.0
244891,West Bengal,NADIA,1997,Whole Year,Pulses total,4094900.0,2266000.0
245463,West Bengal,PURULIA,1997,Rabi,Oilseeds total,823800.0,287500.0

In [28]:
df[(df['Area'] > 5000000) & (df['Area'] < 5555500)]

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
243654,West Bengal,MEDINIPUR WEST,1997,Rabi,Oilseeds total,5251200.0,3519600.0
244290,West Bengal,MURSHIDABAD,1997,Rabi,Oilseeds total,5544000.0,4485800.0

# Grouping

In [29]:
##  allows you to group entries by certain attributes
df.groupby('State_Name')['Area'].mean().head()

State_Name
Andaman and Nicobar Islands     1664.512660
Andhra Pradesh                 13662.842127
Arunachal Pradesh               1714.197172
Assam                           4811.235849
Bihar                           6792.270638
Name: Area, dtype: float64

In [38]:
df.groupby('State_Name')['Area'].value_counts().head(9)

State_Name                   Area
Andaman and Nicobar Islands  1.0     4
                             2.0     3
                             10.0    3
                             81.0    3
                             1.5     2
                             5.0     2
                             22.0    2
                             40.0    2
                             60.0    2
Name: Area, dtype: int64

In [30]:
df.values

array([['Andaman and Nicobar Islands', 'NICOBARS', 2000, ..., 'Arecanut',
        1254.0, 2000.0],
       ['Andaman and Nicobar Islands', 'NICOBARS', 2000, ...,
        'Other Kharif pulses', 2.0, 1.0],
       ['Andaman and Nicobar Islands', 'NICOBARS', 2000, ..., 'Rice',
        102.0, 321.0],
       ...,
       ['West Bengal', 'PURULIA', 2014, ..., 'Sugarcane', 324.0, 16250.0],
       ['West Bengal', 'PURULIA', 2014, ..., 'Rice', 279151.0, 597899.0],
       ['West Bengal', 'PURULIA', 2014, ..., 'Sesamum', 175.0, 88.0]],
      dtype=object)

In [31]:
## Now, you can simply just access elements like you would in an array. 
df.values[0][0]

'Andaman and Nicobar Islands'

# Extracting Rows and Columns

The bracket indexing operator is one way to extract certain columns from a dataframe.

In [44]:
df[['Production', 'Area']].head()

   Production    Area
0      2000.0  1254.0
1         1.0     2.0
2       321.0   102.0
3       641.0   176.0
4       165.0   720.0

Notice that you can acheive the same result by using the loc function. Loc is a veryyyy versatile function that can help you in a lot of accessing and extracting tasks.

In [47]:
df.loc[:, ['Production', 'Area']].head()

   Production    Area
0      2000.0  1254.0
1         1.0     2.0
2       321.0   102.0
3       641.0   176.0
4       165.0   720.0

Note the difference is the return types when you use brackets and when you use double brackets.

In [32]:
type(df['Production'])

pandas.core.series.Series

In [33]:
type(df[['Production']])

pandas.core.frame.DataFrame

You've seen before that you can access columns through df['col name']. You can access rows by using slicing operations.

In [50]:
df[0:3]

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0

Here's an equivalent using iloc

In [51]:
df.iloc[0:3,:]

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0

# Data Cleaning

In [52]:
## if there are any missing values in the dataframe, and will then sum up the total for each column
df.isnull().sum()

State_Name          0
District_Name       0
Crop_Year           0
Season              0
Crop                0
Area                0
Production       3730
dtype: int64

If you do end up having missing values in your datasets, be sure to get familiar with these two functions. 
* **dropna()** - This function allows you to drop all(or some) of the rows that have missing values. 
* **fillna()** - This function allows you replace the rows that have missing values with the value that you pass in.

# Other Useful Functions

* **drop()** - This function removes the column or row that you pass in (You also have the specify the axis). 
* **agg()** - The aggregate function lets you compute summary statistics about each group
* **apply()** - Lets you apply a specific function to any/all elements in a Dataframe or Series
* **get_dummies()** - Helpful for turning categorical data into one hot vectors.
* **drop_duplicates()** - Lets you remove identical rows

<!DOCTYPE html>
<html>
<body>
<div align="center">
<h1>THE END</h1>
    
<h3>By Abhishek Jaiswal & Achraf Jday</h3>
</div>
</body>
</html>